Necesary imports

In [18]:
import pandas as pd

Create example data
That's how the data u provide HAVE TO look

In [3]:
m_names = pd.Series(['Shawshank', 'My Little Pony', 'Transformers', 'Alice in Wonderland'], name='Movie names')
m_rating_norm = pd.Series([0.62, 0.98, 0.32, 0.87, 0.51], name='Rating')    # this is presented here by me in normalised form
m_desc = pd.Series(['Cool stuff about prisons', 'Violent movie about little horses', 'Robots FTW', 'She crazy dude!'], name='Description')
print(m_names, m_rating_norm, m_desc, sep='\n\n')

0              Shawshank
1         My Little Pony
2           Transformers
3    Alice in Wonderland
Name: Movie names, dtype: object

0    0.62
1    0.98
2    0.32
3    0.87
4    0.51
Name: Rating, dtype: float64

0             Cool stuff about prisons
1    Violent movie about little horses
2                           Robots FTW
3                      She crazy dude!
Name: Description, dtype: object

Let's make a bigger dataset

In [21]:
list_of_data = [
    m_names,
    m_desc,
    pd.Series([1998, 2001, 1996, 2013, 2020], name="Release Date"),
    pd.Series(["Spielberg", "Polanski", "Bay", "Snyder", "Jon"], name="Director Name"),
    m_rating_norm,
    pd.Series([120, 98, 113, 187, 102], name="Duration"),
    pd.Series(["Action, Drama", "Action, Sports", "Family", "Action, Musical, S-F", "Animated"], name="Genre"),
    pd.Series(["Actor1, Actor2", "Actor3, Actor2", "Actor1, Actor6","Actor1, Actor2, Actor7, Actor8", "Actor9"], name="Stars")
]

Create a dataframe out of it

In [5]:
movie_data = pd.DataFrame()
movie_data = pd.concat([m_names, m_desc, m_rating_norm], axis=1)
movie_data

           Movie names                        Description  Rating
0            Shawshank           Cool stuff about prisons    0.62
1       My Little Pony  Violent movie about little horses    0.98
2         Transformers                         Robots FTW    0.32
3  Alice in Wonderland                    She crazy dude!    0.87
4                  NaN                                NaN    0.51

Make a nice list of all given data

In [6]:
list_of_all_series = [m_names, m_desc, m_rating_norm]
list_of_all_series

[0              Shawshank
 1         My Little Pony
 2           Transformers
 3    Alice in Wonderland
 Name: Movie names, dtype: object,
 0             Cool stuff about prisons
 1    Violent movie about little horses
 2                           Robots FTW
 3                      She crazy dude!
 Name: Description, dtype: object,
 0    0.62
 1    0.98
 2    0.32
 3    0.87
 4    0.51
 Name: Rating, dtype: float64]

Create a custom function to make a frame out of a list of data

In [7]:
def frame_it(list_of_pd_series):
    return pd.concat(list_of_pd_series, axis=1)

Test the function

In [19]:
df = frame_it(list_of_all_series)
df

           Movie names                        Description  Rating
0            Shawshank           Cool stuff about prisons    0.62
1       My Little Pony  Violent movie about little horses    0.98
2         Transformers                         Robots FTW    0.32
3  Alice in Wonderland                    She crazy dude!    0.87
4                  NaN                                NaN    0.51

Let's try to make a plot out of this data, first we need seaborn

In [9]:
import seaborn as sns

Now let's plot something to see how it works

In [22]:
df = frame_it(list_of_data)
df

,Movie names,Description,Release Date,Director Name,Rating,Duration,Genre,Stars
0,Shawshank,Cool stuff about prisons,1998,Spielberg,0.62,120,"Action, Drama","Actor1, Actor2"
1,My Little Pony,Violent movie about little horses,2001,Polanski,0.98,98,"Action, Sports","Actor3, Actor2"
2,Transformers,Robots FTW,1996,Bay,0.32,113,Family,"Actor1, Actor6"
3,Alice in Wonderland,She crazy dude!,2013,Snyder,0.87,187,"Action, Musical, S-F","Actor1, Actor2, Actor7, Actor8"
4,NaN,NaN,2020,Jon,0.51,102,Animated,Actor9

In [136]:
# x = [('Action' in genre_str) for genre_str in df.loc[:,'Genre']]
# df.loc[x]
action_df = df.loc[df['Genre'].str.contains('Action')]
action_df

,Movie names,Description,Release Date,Director Name,Rating,Duration,Genre,Stars
0,Shawshank,Cool stuff about prisons,1998,Spielberg,0.62,120,"Action, Drama","Actor1, Actor2"
1,My Little Pony,Violent movie about little horses,2001,Polanski,0.98,98,"Action, Sports","Actor3, Actor2"
3,Alice in Wonderland,She crazy dude!,2013,Snyder,0.87,187,"Action, Musical, S-F","Actor1, Actor2, Actor7, Actor8"